Revit 2027 API
Opening.IsRectBoundary Property
Retrieves the information whether the opening has a rectangular boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRectBoundary { get; }
Public ReadOnly Property IsRectBoundary As Boolean
	Get
public:
property bool IsRectBoundary {
	bool get ();
}
member IsRectBoundary : bool with get
Property Value
Boolean
Remarks
If the opening has a rectangular boundary, we can get the geometry information from BoundaryRect property. Otherwise we should get the geometry information from BoundaryCurves property.
See Also
Reference
Opening Class
Autodesk.Revit.DB Namespace